cf_billing/Catalogs/энргТипыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргТипыПриборовУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядностьДоЗапятой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядностьПослеЗапятой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фазность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФазности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаркиПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестМежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестНаличиеВозможностиАвтоРасчетаОбъема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестПогрешность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестЯвляетсяВычислителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмерениеПочасовыхОбъемовЭЭ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SplitИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеРелеУправленияНагрузкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерфейсыПередачиДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИнтерфейсыПередачиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетногоМеханизма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидСчетногоМеханизма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТарифов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргНаправлениеУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыПодключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСхемыПодключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмерительныеКаналы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИзмерительныеКаналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМоделиПрибораУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинальный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Максимальный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>I1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>I2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>U1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>U2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяНагрузкаВКлассеТочности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Enums/энргТипыСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСПД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргТипыПриборовУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Рассчитать коэффициент ПУ по данным трансформаторов
//
// Параметры:
//  ТипыПУ - Массив - массив ссылок на справочник энргТипыПриборовУчета
// 
// Возвращаемое значение:
//   Число - коэффициент ПУ
//
Функция РассчитатьКоэффициентПУПоДаннымТрансформаторов(ТипыПУ) Экспорт
	
	Результат = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(энргМаркиПриборовУчета.ТипСИ, ЗНАЧЕНИЕ(Перечисление.энргТипыСИ.ПУ)) КАК ТипСИ,
	                      |	энргТипыПриборовУчета.Ссылка КАК ТипПрибораУчета,
	                      |	энргТипыПриборовУчета.I1 КАК I1,
	                      |	энргТипыПриборовУчета.I2 КАК I2,
	                      |	энргТипыПриборовУчета.U1 КАК U1,
	                      |	энргТипыПриборовУчета.U2 КАК U2
	                      |ПОМЕСТИТЬ ВТ_ТипыСИ
	                      |ИЗ
	                      |	Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
	                      |		ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
	                      |ГДЕ
	                      |	энргТипыПриборовУчета.Ссылка В(&МассивТипПУ)
	                      |	И ЕСТЬNULL(энргМаркиПриборовУчета.ТипСИ, ЗНАЧЕНИЕ(Перечисление.энргТипыСИ.ПУ)) В (&МассивТипСИ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.I1), 0) КАК I1,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.I2), 0) КАК I2,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.U1), 0) КАК U1,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВТ_ТипыСИ.U2), 0) КАК U2
	                      |ИЗ
	                      |	ВТ_ТипыСИ КАК ВТ_ТипыСИ");
	
	Запрос.УстановитьПараметр("МассивТипПУ", ТипыПУ);  
	ТипыСИ = Новый Массив;
	ТипыСИ.Добавить(Перечисления.энргТипыСИ.ТТ);
	ТипыСИ.Добавить(Перечисления.энргТипыСИ.ТН);
	Запрос.УстановитьПараметр("МассивТипСИ", ТипыСИ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.U1 <> 0 И Выборка.U2 <> 0 И Выборка.I1 <> 0 И Выборка.I2 <> 0 Тогда
		Результат = (Выборка.U1 / Выборка.U2) * (Выборка.I1 / Выборка.I2);
	ИначеЕсли Выборка.I1 <> 0 И Выборка.I2 <> 0 Тогда
		Результат = Выборка.I1 / Выборка.I2;
	ИначеЕсли Выборка.U1 <> 0 И Выборка.U2 <> 0 Тогда
		Результат = Выборка.U1 / Выборка.U2;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
